In [1]:
import pandas as pd
import seaborn as sns

In [4]:
veri=sns.load_dataset("titanic")
veri.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
veri.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [8]:
veri.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

unstack eklemek hiyarişik karmaşıklıgı çözer

**Pivot ile Tablo**

In [9]:
veri.pivot_table("survived",index="sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

index olarak girdigimiz yeri satır olarak değerlendiriyor.columns ise sütünları ifade ediyor.

In [13]:
age=pd.cut(veri["age"],[0,18,50,90]) #sürekli değişkeni katagorik değişkene dönüştürdük
age.head(10)

0    (18.0, 50.0]
1    (18.0, 50.0]
2    (18.0, 50.0]
3    (18.0, 50.0]
4    (18.0, 50.0]
5             NaN
6    (50.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 50.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (3, interval[int64, right]): [(0, 18] < (18, 50] < (50, 90]]

In [14]:
veri.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 50]  0.967213  0.912281  0.413793
       (50, 90]  1.000000  0.666667  1.000000
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 50]  0.442857  0.069444  0.139896
       (50, 90]  0.192308  0.083333  0.000000